// Внас є пряма вздовж якою скачуть дв кроля. 
// 1 кріль пригає на дві клітинки за одиницю часу. 
// Другий кріль пригає на 3 клітинки за одиницю часу. 
// Написати функцію котра приймає два параметри:
// Стартову точку першого кроля на цій прямій
// Стартову точку 2 кроля на цій же прямій. 
// Функція має повернути координату точки на якій кролі зустрінуться або null якщо такої точки не має))

function determineMeeting (x,y) {
  if (x <= y) {return null}
  while (x > y){
    x +=2;
    y +=3;
  }

  return x
}

console.log(determineMeeting(8,6)); //12
console.log(determineMeeting(1,7)); //null
console.log(determineMeeting(24,10)); //12